## Production: app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 13 to add, 7 to change, 11 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.lambda_app_invoke will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_app_invoke"  {
      ~ id      = "3179861024" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ca-central-1:957818836222:function:Templates",
                          - "arn:aws:lambda:ca-central-1:957818836222:function:Submission",
                          - "arn:aws:lambda:ca-central-1:957818836222:function:Retrieval",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:lambda:ca-central-1:957818836222:function:Retrieval",
                # (2 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.form_viewer_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "form_viewer_task"  {
      ~ id       = "e29855ae5f17281e36941bc7af8ebf1525960903d6d0a57d5ae491736ba7be5e" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "SUBMISSION_API"
                          - value = "arn:aws:lambda:ca-central-1:957818836222:function:Submission"
                        },
                      - {
                          - name  = "TEMPLATES_API"
                          - value = "arn:aws:lambda:ca-central-1:957818836222:function:Templates"
                        },
                      - {
                          - name  = "ORGANISATIONS_API"
                          - value = "arn:aws:lambda:ca-central-1:957818836222:function:Organisations"
                        },
                      - {
                          - name  = "NEXTAUTH_URL"
                          - value = "https://forms-formulaires.alpha.canada.ca"
                        },
                      - {
                          - name  = "REDIS_URL"
                          - value = "gcforms-redis-rep-group.iyrckm.ng.0001.cac1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "RELIABILITY_FILE_STORAGE"
                          - value = "forms-production-reliability-file-storage"
                        },
                    ]
                  - image            = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/form_viewer_production"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "Forms"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-form-viewer"
                        }
                    }
                  - name             = "form_viewer"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:notify_api_key-sLtddr"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:google_client_id-7VwI9F"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:google_client_secret-aPRebC"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:server-database-url-jVtWGE"
                        },
                      - {
                          - name      = "TOKEN_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:token_secret-jw4Dou"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ template = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "TEMPLATES_API"
                            value = "${templates_api}"
                        },
                      ~ {
                          ~ name  = "ORGANISATIONS_API" -> "ORGANIZATIONS_API"
                          ~ value = "${organisations_api}" -> "${organizations_api}"
                        },
                        {
                            name  = "NEXTAUTH_URL"
                            value = "${nextauth_url}"
                        },
                        # (2 unchanged elements hidden)
                    ]
                    # (6 unchanged elements hidden)
                },
            ]
        )
      ~ vars     = {
          - "organisations_api"        = "arn:aws:lambda:ca-central-1:957818836222:function:Organisations" -> null
          + "organizations_api"        = (known after apply)
            # (16 unchanged elements hidden)
        }
    }

  # aws_ecs_task_definition.form_viewer must be replaced
-/+ resource "aws_ecs_task_definition" "form_viewer" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:957818836222:task-definition/form-viewer:13" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "NEXTAUTH_URL"
                          - value = "https://forms-formulaires.alpha.canada.ca"
                        },
                      - {
                          - name  = "ORGANISATIONS_API"
                          - value = "arn:aws:lambda:ca-central-1:957818836222:function:Organisations"
                        },
                      - {
                          - name  = "REDIS_URL"
                          - value = "gcforms-redis-rep-group.iyrckm.ng.0001.cac1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "RELIABILITY_FILE_STORAGE"
                          - value = "forms-production-reliability-file-storage"
                        },
                      - {
                          - name  = "SUBMISSION_API"
                          - value = "arn:aws:lambda:ca-central-1:957818836222:function:Submission"
                        },
                      - {
                          - name  = "TEMPLATES_API"
                          - value = "arn:aws:lambda:ca-central-1:957818836222:function:Templates"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                    ]
                  - essential        = true
                  - image            = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/form_viewer_production"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "Forms"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-form-viewer"
                        }
                    }
                  - mountPoints      = []
                  - name             = "form_viewer"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:notify_api_key-sLtddr"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:google_client_id-7VwI9F"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:google_client_secret-aPRebC"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:server-database-url-jVtWGE"
                        },
                      - {
                          - name      = "TOKEN_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:token_secret-jw4Dou"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "form-viewer" -> (known after apply)
      ~ revision                 = 13 -> (known after apply)
      + skip_destroy             = false
        tags                     = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.forms_dynamodb will be updated in-place
  ~ resource "aws_iam_policy" "forms_dynamodb" {
        id          = "arn:aws:iam::957818836222:policy/forms_dynamodb"
        name        = "forms_dynamodb"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          + "arn:aws:dynamodb:ca-central-1:957818836222:table/Vault/index/*",
                            "arn:aws:dynamodb:ca-central-1:957818836222:table/Vault",
                            # (1 unchanged element hidden)
                        ]
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags        = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_app_invoke will be updated in-place
  ~ resource "aws_iam_policy" "lambda_app_invoke" {
        id          = "arn:aws:iam::957818836222:policy/lambda_app_invoke"
        name        = "lambda_app_invoke"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ca-central-1:957818836222:function:Templates",
                          - "arn:aws:lambda:ca-central-1:957818836222:function:Submission",
                          - "arn:aws:lambda:ca-central-1:957818836222:function:Retrieval",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_dynamodb will be updated in-place
  ~ resource "aws_iam_policy" "lambda_dynamodb" {
        id          = "arn:aws:iam::957818836222:policy/lambda_dynamobdb"
        name        = "lambda_dynamobdb"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "dynamodb:GetItem",
                          - "dynamodb:PutItem",
                            "dynamodb:UpdateItem",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                            "dynamodb:Scan",
                            "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetShardIterator",
                          + "dynamodb:GetRecords",
                          + "dynamodb:GetItem",
                          + "dynamodb:DescribeStream",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:BatchWriteItem",
                        ]
                      ~ Resource = [
                          - "arn:aws:dynamodb:ca-central-1:957818836222:table/ReliabilityQueue",
                          + "arn:aws:dynamodb:ca-central-1:957818836222:table/Vault/index/*",
                            "arn:aws:dynamodb:ca-central-1:957818836222:table/Vault",
                          + "arn:aws:dynamodb:ca-central-1:957818836222:table/ReliabilityQueue",
                          + "",
                        ]
                      + Sid      = ""
                        # (1 unchanged element hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags        = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_kms will be updated in-place
  ~ resource "aws_iam_policy" "lambda_kms" {
        id          = "arn:aws:iam::957818836222:policy/lambda_kms"
        name        = "lambda_kms"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = "arn:aws:kms:ca-central-1:957818836222:key/afbaea67-8277-4a4c-853e-7697dd2dade5" -> [
                          + "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d",
                          + "arn:aws:kms:ca-central-1:957818836222:key/afbaea67-8277-4a4c-853e-7697dd2dade5",
                        ]
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags        = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_sns will be created
  + resource "aws_iam_policy" "lambda_sns" {
      + arn         = (known after apply)
      + description = "IAM policy for allowing lambda to publish message in SNS for Slack notification"
      + id          = (known after apply)
      + name        = "lambda_sns"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sns:Publish"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sns:ca-central-1:957818836222:alert-critical"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role_policy_attachment.lambda_sns will be created
  + resource "aws_iam_role_policy_attachment" "lambda_sns" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_lambda_event_source_mapping.vault_updated_item_stream will be created
  + resource "aws_lambda_event_source_mapping" "vault_updated_item_stream" {
      + batch_size                    = 25
      + enabled                       = true
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = 3
      + parallelization_factor        = (known after apply)
      + starting_position             = "LATEST"
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)

      + filter_criteria {
          + filter {
              + pattern = jsonencode(
                    {
                      + dynamodb = {
                          + NewImage = {
                              + Retrieved = {
                                  + N = [
                                      + "1",
                                    ]
                                }
                            }
                        }
                    }
                )
            }
        }
    }

  # aws_lambda_function.archiver will be created
  + resource "aws_lambda_function" "archiver" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/archiver_main.zip"
      + function_name                  = "Archiver"
      + handler                        = "archiver.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::957818836222:role/iam_for_lambda"
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "99ZftLk+TI8hhKlGtTjGbXRCOJGBxv7zNCra3jVNeEI="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ARCHIVING_S3_BUCKET"       = "forms-production-archive-storage"
              + "DYNAMODB_VAULT_TABLE_NAME" = ""
              + "REGION"                    = "ca-central-1"
              + "SNS_ERROR_TOPIC_ARN"       = "arn:aws:sns:ca-central-1:957818836222:alert-critical"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_function.organisations will be destroyed
  - resource "aws_lambda_function" "organisations" {
      - architectures                  = [] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:957818836222:function:Organisations" -> null
      - filename                       = "/tmp/organisations_main.zip" -> null
      - function_name                  = "Organisations" -> null
      - handler                        = "organisations.handler" -> null
      - id                             = "Organisations" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:957818836222:function:Organisations/invocations" -> null
      - last_modified                  = "2022-02-23T15:09:51.198+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ca-central-1:957818836222:layer:organisations_node_packages:4",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:957818836222:function:Organisations:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::957818836222:role/iam_for_lambda" -> null
      - runtime                        = "nodejs14.x" -> null
      - source_code_hash               = "HEaYM+wSkzD9IqfJijAS6eTLOmItfqg7UMGdcadEugE=" -> null
      - source_code_size               = 1876 -> null
      - tags                           = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - timeout                        = 10 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "DB_ARN"    = "arn:aws:rds:ca-central-1:957818836222:cluster:forms-db-cluster"
              - "DB_NAME"   = "forms"
              - "DB_SECRET" = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:database-secret-RThElE"
              - "REGION"    = "ca-central-1"
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_function.organizations will be created
  + resource "aws_lambda_function" "organizations" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/organizations_main.zip"
      + function_name                  = "Organizations"
      + handler                        = "organizations.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::957818836222:role/iam_for_lambda"
      + runtime                        = "nodejs14.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "/dD0FpfPmlYBTolF5zwbDFRxttK211apW9+eHZJXo5M="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_ARN"    = "arn:aws:rds:ca-central-1:957818836222:cluster:forms-db-cluster"
              + "DB_NAME"   = "forms"
              + "DB_SECRET" = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:database-secret-RThElE"
              + "REGION"    = "ca-central-1"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ last_modified                  = "2022-02-23T15:10:04.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:957818836222:layer:reliability_lib_packages:11",
          - "arn:aws:lambda:ca-central-1:957818836222:layer:reliability_node_packages:26",
        ] -> (known after apply)
      ~ source_code_hash               = "kKVXUTOl7bxkXyVCDpHfYHCwp9TYSOmd4VZMDOF+4bg=" -> "WouKYnodMfVSed6wS3XP/4KlLu656p7uIvgtwwM439g="
        tags                           = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (23 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.retrieval will be destroyed
  - resource "aws_lambda_function" "retrieval" {
      - architectures                  = [] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:957818836222:function:Retrieval" -> null
      - filename                       = "/tmp/retrieval_main.zip" -> null
      - function_name                  = "Retrieval" -> null
      - handler                        = "retrieval.handler" -> null
      - id                             = "Retrieval" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:957818836222:function:Retrieval/invocations" -> null
      - last_modified                  = "2022-02-23T15:09:40.760+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ca-central-1:957818836222:layer:retrieval_node_packages:7",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:957818836222:function:Retrieval:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::957818836222:role/iam_for_lambda" -> null
      - runtime                        = "nodejs14.x" -> null
      - source_code_hash               = "RlmK/g1kRRHU/YVN2D6mFYs9BI5iEsejl/euOkwl02U=" -> null
      - source_code_size               = 1042 -> null
      - tags                           = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "DB_ARN"    = "arn:aws:rds:ca-central-1:957818836222:cluster:forms-db-cluster"
              - "DB_NAME"   = "forms"
              - "DB_SECRET" = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:database-secret-RThElE"
              - "REGION"    = "ca-central-1"
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_function.submission will be updated in-place
  ~ resource "aws_lambda_function" "submission" {
        id                             = "Submission"
      ~ last_modified                  = "2022-02-23T15:10:13.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:957818836222:layer:submission_node_packages:16",
        ] -> (known after apply)
      ~ source_code_hash               = "utsw1p1B1FGxoyhkFkWrwcgzzBUdUy+gDAk892EOk9o=" -> "RIxQbTwrxUzKugkChb1FlVs4C6kSmSIMywW69xe7io4="
        tags                           = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.templates will be updated in-place
  ~ resource "aws_lambda_function" "templates" {
        id                             = "Templates"
      ~ last_modified                  = "2022-02-23T15:10:23.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:957818836222:layer:templates_node_packages:5",
        ] -> (known after apply)
      ~ source_code_hash               = "1W/tI0yYfXq5Fh5OOGEeCU2pN7LLIdX2F9ZLsWGc9gQ=" -> "8mcVYZgJ0vvIyHOfwYDQH2aA5/G7M6Vi1IcQJTBl3fc="
        tags                           = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.archiver_lib will be created
  + resource "aws_lambda_layer_version" "archiver_lib" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "nodejs12.x",
          + "nodejs14.x",
        ]
      + created_date                = (known after apply)
      + filename                    = "/tmp/archiver_lib.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "archiver_node_packages"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "6EaOCWtM0rc2WfdwXcgyZNOQSsCXcyY73GXzKeOiXBA="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_lambda_layer_version.organisations_lib will be destroyed
  - resource "aws_lambda_layer_version" "organisations_lib" {
      - arn                      = "arn:aws:lambda:ca-central-1:957818836222:layer:organisations_node_packages:4" -> null
      - compatible_architectures = [] -> null
      - compatible_runtimes      = [
          - "nodejs12.x",
          - "nodejs14.x",
        ] -> null
      - created_date             = "2022-02-23T15:09:41.834+0000" -> null
      - filename                 = "/tmp/organisations_lib.zip" -> null
      - id                       = "arn:aws:lambda:ca-central-1:957818836222:layer:organisations_node_packages:4" -> null
      - layer_arn                = "arn:aws:lambda:ca-central-1:957818836222:layer:organisations_node_packages" -> null
      - layer_name               = "organisations_node_packages" -> null
      - source_code_hash         = "UZV1JpXw33RXbizFL85Mi/6h/PNJaHgsahzu5Aj9gTM=" -> null
      - source_code_size         = 1974360 -> null
      - version                  = "4" -> null
    }

  # aws_lambda_layer_version.organizations_lib will be created
  + resource "aws_lambda_layer_version" "organizations_lib" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "nodejs12.x",
          + "nodejs14.x",
        ]
      + created_date                = (known after apply)
      + filename                    = "/tmp/organizations_lib.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "organizations_node_packages"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "gGBHcXS9+7dfmR/NWil1jTI3zjUZL11a5vz8vzbh7EE="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_lambda_layer_version.reliability_lib must be replaced
-/+ resource "aws_lambda_layer_version" "reliability_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:957818836222:layer:reliability_lib_packages:11" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2022-02-23T15:09:35.326+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:957818836222:layer:reliability_lib_packages:11" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:957818836222:layer:reliability_lib_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false # forces replacement
      ~ source_code_hash            = "ku4dhZMcNr/hiGkN9ukcoHOSXP9xWu3LcX4y8grJBHc=" -> "s3LCXB4zLXdTmGLEglxwEIYtkcWqv3VNomWJm+f3bJY=" # forces replacement
      ~ source_code_size            = 5647 -> (known after apply)
      ~ version                     = "11" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.reliability_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "reliability_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:957818836222:layer:reliability_node_packages:26" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2022-02-23T15:09:54.063+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:957818836222:layer:reliability_node_packages:26" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:957818836222:layer:reliability_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false # forces replacement
      ~ source_code_hash            = "9+Ma3rBmKgGdrIgvNY9e4AUCD1Xg6JBWtJ7sJ+e+xFY=" -> "yG8GCi/gRMa2cZuRNrqOR+9gvb2SIGwjmUj1gmnDaQk=" # forces replacement
      ~ source_code_size            = 4827437 -> (known after apply)
      ~ version                     = "26" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.retrieval_lib will be destroyed
  - resource "aws_lambda_layer_version" "retrieval_lib" {
      - arn                      = "arn:aws:lambda:ca-central-1:957818836222:layer:retrieval_node_packages:7" -> null
      - compatible_architectures = [] -> null
      - compatible_runtimes      = [
          - "nodejs12.x",
          - "nodejs14.x",
        ] -> null
      - created_date             = "2022-02-23T15:09:32.152+0000" -> null
      - filename                 = "/tmp/retrieval_lib.zip" -> null
      - id                       = "arn:aws:lambda:ca-central-1:957818836222:layer:retrieval_node_packages:7" -> null
      - layer_arn                = "arn:aws:lambda:ca-central-1:957818836222:layer:retrieval_node_packages" -> null
      - layer_name               = "retrieval_node_packages" -> null
      - source_code_hash         = "sHRojJzw3/ZKcTZflms9oTwUkYo++ULGxQ9rpViMLQ4=" -> null
      - source_code_size         = 2357713 -> null
      - version                  = "7" -> null
    }

  # aws_lambda_layer_version.submission_lib must be replaced
-/+ resource "aws_lambda_layer_version" "submission_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:957818836222:layer:submission_node_packages:16" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2022-02-23T15:10:02.660+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:957818836222:layer:submission_node_packages:16" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:957818836222:layer:submission_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false # forces replacement
      ~ source_code_hash            = "yAEvKNYaIGKFoL1S68ZlyNuZVkFXLEb3opUtsD9P8vo=" -> "RxgdBRwgXDqiTIUyeLsDBuC3Q4RZ4gLBKXRRzZE5yv0=" # forces replacement
      ~ source_code_size            = 2491209 -> (known after apply)
      ~ version                     = "16" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.templates_lib must be replaced
-/+ resource "aws_lambda_layer_version" "templates_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:957818836222:layer:templates_node_packages:5" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2022-02-23T15:10:10.817+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:957818836222:layer:templates_node_packages:5" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:957818836222:layer:templates_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false # forces replacement
      ~ source_code_hash            = "6GVOdNIwQtwZP6HpHcsWbeBBytO2iggjUw1p6FVMjEw=" -> "PnBssKPR3ZkaFKRaPQyJY2Cui43Z3KGNt01yxscopic=" # forces replacement
      ~ source_code_size            = 2087118 -> (known after apply)
      ~ version                     = "5" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_permission.organisations will be destroyed
  - resource "aws_lambda_permission" "organisations" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "Organisations" -> null
      - id            = "AllowInvokeECS" -> null
      - principal     = "arn:aws:iam::957818836222:role/form-viewer" -> null
      - statement_id  = "AllowInvokeECS" -> null
    }

  # aws_lambda_permission.organizations will be created
  + resource "aws_lambda_permission" "organizations" {
      + action        = "lambda:InvokeFunction"
      + function_name = "Organizations"
      + id            = (known after apply)
      + principal     = "arn:aws:iam::957818836222:role/form-viewer"
      + statement_id  = "AllowInvokeECS"
    }

  # aws_lambda_permission.retrieval will be destroyed
  - resource "aws_lambda_permission" "retrieval" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "Retrieval" -> null
      - id            = "AllowInvokeECS" -> null
      - principal     = "arn:aws:iam::957818836222:role/form-viewer" -> null
      - statement_id  = "AllowInvokeECS" -> null
    }

Plan: 13 to add, 7 to change, 11 to destroy.

Changes to Outputs:
  + lambda_reliability_log_group_name = "/aws/lambda/Reliability"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

9 tests, 9 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
